month = int(input("Введите номер месяца от 1 до 12: "))

year_dict = {
    1: "зима",
    2: "зима",
    3: "весна",
    4: "весна",
    5: "весна",
    6: "лето",
    7: "лето",
    8: "лето",
    9: "осень",
    10: "осень",
    11: "осень",
    12: "зима"
}

year_list = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль",
             "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]

if month >= 1 and month <= 12:
    print(f"Ваш месяц относится к времени года: {year_dict[month]}")
    print(f"Ваш месяц: {year_list[month - 1]}")
else:
    print("Не существует месяца с таким номером")